const config = require('../config');

module.exports = Object.freeze({
  welcome: process.env.GREET_MSG
    ? process.env.GREET_MSG
    : `Привіт. Це чатбот для бізнесу, який спрощує процес опису вакансій. І допомагає їм оперативно з'явитися в Telegram-каналі <a href="${config.channel.url}">${config.channel.name}</a>, щоб пришвидшити зв'язок між роботодавцем та кандидатом. \n\nДля цього вам необхідно буде послідовно заповнити наступні поля:\n1. Назва компанії роботодавця\n2. Назва вакансії\n3. Населений пункт, в якому розташовано робоче місце\n4. Короткий опис вакансії\n5. Розмір заробітньої плати\n6. Контактні дані роботодавця\n\nПісля цього ваша вакансія відправиться на модерацію і буде опублікована у Телеграм-каналі <a href="${config.channel.url}">${config.channel.name}</a>\n<b>Готові? Натискайте "Розмістити вакансію"</b>`,
  default:
    'Для розміщення вашої вакансії натисніть кнопку "Розмістити вакансію"',
  buttons: {
    shareJob: 'Розмістити вакансію',
    sendToModerator: 'Надіслати на модерацію',
    cancel: 'Відхилити',
    rePublish: 'Розмістити повторно',
    noActual: 'Вакансія не актуальна',
    publish: 'Опублікувати',
    decline: 'Відхилити',
  },
  shareJobFlow: {
    componyName:
      'Назва підприємства \n(<i>наприклад, Салон краси "Beauty Zone", ФОП Карпенко О. Л. тощо</i>)',
    settlement:
      'Населений пункт, у якому розташоване робоче місце \n(<i>наприклад, м. Канів, смт. Ірдинь тощо</i>) ',
    jobName:
      'Назва вакансії \n(<i>наприклад, майстер манікюру, пекар тощо</i>)',
    jobDescription: `Опис вакансії: основні посадові обов'язки, вимоги до працівника, графік роботи та інша важлива інформація. Для більшої інформативності та зручності пошуку, ви можете додати активні посилання та #хештеги.`,
    jobSalary:
      'Розмір заробітньої плати \n(<i>наприклад, 15 000 грн, договірна тощо</i>)',
    contactData: `Ваші контактні дані для зв'язку із кандидатами: номер телефону, ім'я контактної особи, електронна пошта \n(<i>наприклад, +380956784398, Світлана, svitlana_recruitment@gmail.com</i>)`,
    preView: (data) =>
      `Ваша вакансія матиме такий вигляд. Якщо усі дані введено коректно, ви можете <b>відправити допис на модерацію</b>.\nПісля перевірки модератора <b>ваша вакансія буде або опублікована, або відхилена з певних причин</b>, про що ви отримаєте сповіщення.\nЯкщо дані введено некоректно, <b>ви можете відхилити вакансію</b> і внести інформацію ще раз.\n\n` +
      `<b>${data.jobName.toUpperCase()}</b>\n` +
      `<b>${data.componyName}</b>\n` +
      `<b>#${data.countId}</b>\n\n` +
      `<b>⛳ Населений пункт:</b> ${data.settlement}\n\n` +
      `<b>💰 Заробітна плата:</b> ${data.jobSalary}\n\n` +
      `<b>✏️ Опис вакансії:</b>\n${data.jobDescription}\n\n` +
      `<b>📞 Контактні дані:</b> ${data.contactData}\n\n` +
      `${data.timestamp}\n\n` +
      '❗️ Шукаєте працівників? Діліться актуальними вакансіями в цьому каналі' +
      ` за допомогою Telegram боту @${config.bot.url}` +
      ` "${config.bot.name}".\nTelegram бот створено командою` +
      ' Master of Code Global',
    publish: (data) =>
      `<b>${data.jobName.toUpperCase()}</b>\n` +
      `<b>${data.componyName}</b>\n` +
      `<b>#${data.countId}</b>\n\n` +
      `<b>⛳ Населений пункт:</b> ${data.settlement}\n\n` +
      `<b>💰 Заробітна плата:</b> ${data.jobSalary}\n\n` +
      `<b>✏️ Опис вакансії:</b>\n${data.jobDescription}\n\n` +
      `<b>📞 Контактні дані:</b> ${data.contactData}\n\n` +
      `${data.timestamp}\n\n` +
      '❗️ Шукаєте працівників? Діліться актуальними вакансіями в цьому каналі' +
      ` за допомогою Telegram боту @${config.bot.url}` +
      ` "${config.bot.name}".\nTelegram бот створено командою` +
      ' Master of Code Global',
  },
  moderating: {
    sendToModerator: (countId) =>
      `Ваша вакансія #${countId} відправлена на модерацію. Ви отримаєте повідомлення про її підтвердження або відхилення.`,
    request: (from) => `Запит на модерацію від ${from}`,
    declined: (countId) => `Ваша вакансія #${countId} була відхилена.`,
    published: (countId) =>
      `Дякуємо, вакансія #${countId} була успішно опублікована!`,
  },
  error:
    'Схоже сталось помилка, натисніть будь ласка /start,' +
    ' щоб розпочати з початку.',
  jobRePublished: (countId) =>
    `Привіт! Ваша вакансія #${countId} була видалена через 48 години` +
    ' з моменту публікації. Якщо бажаєте розмістити її повторно, натисніть,' +
    ' будь ласка, кнопку "Розмістити повторно".',
  jobPublished: (countId) =>
    `Ваша вакансія #${countId} була успішно розміщена в нашому ` +
    `<a href="${config.channel.url}">Telegram-каналі</a>`,
  jobCanceled: (countId) =>
    `На жаль, ваша вакансія #${countId} не пройшла процес модерації.` +
    ' Якщо бажаєте спробувати знову натисніть кнопку “Розмістити вакансію”.',
});
